pradeepa-s/pdlib_nrf24l01/arm/stellaris_lm4f120h5qr/pdlib_nrf24l01.c
	// PS: Set to TX mode
	ucCurrentVal = NRF24L01_RegisterRead_8(RF24_CONFIG);
	ucCurrentVal &= (~RF24_PRIM_RX);
	
	NRF24L01_RegisterWrite_8(RF24_CONFIG, ucCurrentVal);

	_NRF24L01_CEHigh();

	PrintString("TX mode enabled\n\r");
}

/* PS:
 *
 * Function		: 	NRF24L01_DisableTxMode
 *
 * Arguments	: 	None
 *
 * Return		: 	None
 *
 * Description	: 	Put the module into Standby I state with TX mode.
 *
 */
void NRF24L01_DisableTxMode()
{
	_NRF24L01_CELow();

	PrintString("TX mode disabled\n\r");
}


/* PS:
 * 
 * Function		: 	NRF24L01_IsDataReadyRx
 * 
 * Arguments	: 	pcPipeNo [out] : Pipe number which contains the RX payload
 * 
 * Return		: 	PDLIB_NRF24_INVALID_ARGUMENT	:	Invalid input argument
 * 					PDLIB_NRF24_ERROR				:	Data is not in RX FIFO
 * 					PDLIB_NRF24_SUCCESS				:	Data is in RX FIFO
 * 
 * Description	: 	Get the state of RX data.
 * 					If the return is 'PDLIB_NRF24_SUCCESS' then the pcPipeNo will contain the pipe which has data.
 * 
 */
 
int
NRF24L01_IsDataReadyRx(char *pcPipeNo)
{
	int ret = PDLIB_NRF24_ERROR;
	char cDataReady;

	if(NULL == pcPipeNo)
	{
		ret = PDLIB_NRF24_INVALID_ARGUMENT;
	}else
	{
		NRF24L01_GetStatus();

		cDataReady = ((g_ucStatus & RF24_RX_DR) ? 1 : 0);
		*pcPipeNo = ((g_ucStatus & ( BIT3 | BIT2 | BIT1)) >> 1);

		// *pcPipeNo will be 7 if the RX fifo is empty
		if(cDataReady && (*pcPipeNo < 6))
		{
			ret = PDLIB_NRF24_SUCCESS;
		}else
		{
			// Reset the value in the pipe number
			*pcPipeNo = 0xFF;
			ret = PDLIB_NRF24_ERROR;
		}
	}

	return ret;
}


/* PS:
 *
 * Function		: 	NRF24L01_WaitForDataRx
 *
 * Arguments	: 	pcPipeNo [out] : Pipe number which contains the RX payload
 *
 * Return		: 	PDLIB_NRF24_ERROR	:	Invalid input argument
 * 					PDLIB_NRF24_SUCCESS	:	Data is in RX FIFO
 *
 * Description	: 	Wait until any RX pipe has data
 *
 */

int NRF24L01_WaitForDataRx(char *pcPipeNo)
{
	int iRet = PDLIB_NRF24_ERROR;

	NRF24L01_EnableRxMode();
	PrintString("Waiting for data...\n\r");
/*
	PrintRegValue("CONFIG: ",NRF24L01_RegisterRead_8(RF24_CONFIG));
	PrintRegValue("EN_RXADDR: ",NRF24L01_RegisterRead_8(RF24_EN_RXADDR));
	PrintRegValue("EN_AA: ",NRF24L01_RegisterRead_8(RF24_EN_AA));
	PrintRegValue("RX_PW_P0: ",NRF24L01_RegisterRead_8(RF24_RX_PW_P0));*/

	while(iRet == PDLIB_NRF24_ERROR)
	{
		iRet = NRF24L01_IsDataReadyRx(pcPipeNo);
	}


	NRF24L01_DisableRxMode();

	return iRet;
}



/* PS:
 *
 * Function		: 	NRF24L01_IsTxFifoFull
 *
 * Arguments	: 	None
 *
 * Return		: 	0	:	TX FIFO is NOT full
 * 					1	:	TX FIFO is full
 *
 * Description	: 	Get the state of TX FIFO
 *
 */

int
NRF24L01_IsTxFifoFull()
{
	unsigned char ucTxFifo;
	ucTxFifo = NRF24L01_RegisterRead_8(RF24_FIFO_STATUS);

	return ((ucTxFifo & RF24_FIFO_FULL) ? 1 : 0);
}



/* PS:
 * 
 * Function		: 	NRF24L01_GetRxDataAmount
 * 
 * Arguments	: 	ucDataPipe	:	Index of the pipe
 * 
 * Return		: 	Available number of bytes.
 * 
 * Description	: 	Reading the number of data bytes available
 * 					in the specified pipe.
 * 
 */

unsigned char
NRF24L01_GetRxDataAmount(unsigned char ucDataPipe)
{
	unsigned char ucTemp;
	if(ucDataPipe < 6)
	{
		ucTemp = NRF24L01_RegisterRead_8(RF24_RX_PW_P0 + ucDataPipe);
		return (ucTemp & 0x3F);
	}else
	{
		return 0;
	}
}
	
	
/* PS:
 * 
 * Function		: 	NRF24L01_SetTXAddress
 * 
 * Arguments	: 	address	:	Buffer which contains the five bytes to put to address.
 * 
 * Return		: 	None
 * 
 * Description	: 	Set the address of the module for TX mode. The data
 * 					packet which is transmitted from this RF module will
 * 					contain this address as destination address.
 * 
 */
 
void 
NRF24L01_SetTXAddress(unsigned char* address)
{
	NRF24L01_RegisterWrite_Multi(RF24_TX_ADDR, (unsigned char*)address, 5);
}

/* PS:
 *
 * Function		: 	NRF24L01_WaitForTxComplete
 *
 * Arguments	: 	None
 *
 * Return		: 	PDLIB_NRF24_SUCCESS			:	TX completed successfully
 *					PDLIB_NRF24_TX_ARC_REACHED	:	Maximum retransmissions elapsed
 *
 * Description	: 	The function can wait until the
 * 						-TX payload is successfully delivered (If ACK is available)
 * 						or
 * 						-TX payload has successfully transmitted.
 *
 *					Ths function will return 0 or a negetive error code.
 */

int
NRF24L01_WaitForTxComplete()
{
	int ret = PDLIB_NRF24_SUCCESS;

	NRF24L01_GetStatus();

	//PrintRegValue("Current status :",g_ucStatus);

	while((g_ucStatus & (RF24_MAX_RT | RF24_TX_DS)) == 0)
	{
		NRF24L01_GetStatus();
		//PrintRegValue("Current status :",g_ucStatus);
	}

	if(g_ucStatus & RF24_MAX_RT)
	{
		PrintRegValue("Maximum retransmissions reached!!! : status >> ",g_ucStatus);
		ret = PDLIB_NRF24_TX_ARC_REACHED;
	}

	return ret;
}


/* PS:
 *
 * Function		: 	NRF24L01_AttemptTx
 *
 * Arguments	: 	None
 *
 * Return		: 	PDLIB_NRF24_SUCCESS			:	TX completed successfully
 *					PDLIB_NRF24_TX_ARC_REACHED	:	Maximum retransmissions elapsed
 *
 * Description	: 	This function will attempt to TX whatever data available in the
 * 					TX payload. It waits until the TX is done or maximum retransmissions
 * 					occur.
 *
 * 					Module will be in Power Down mode when it returns.
 */

int NRF24L01_AttemptTx()
{
	int ret = PDLIB_NRF24_SUCCESS;

	PrintString("Attempting TX...\n\r");

	NRF24L01_PowerUp();

	NRF24L01_EnableTxMode();

	ret = NRF24L01_WaitForTxComplete();

	NRF24L01_DisableTxMode();

	NRF24L01_PowerDown();

	return ret;
}

/* PS:
 * 
 * Function		: 	NRF24L01_SetRXAddress
 * 
 * Arguments	: 	ucDataPipe	:	Data pipe number
 * 					pucAddress	:	Buffer which contains the one/five bytes to put to address.
 * 
 * Return		: 	None
 * 
 * Description	: 	Set the RX address. P0 and P1 pipes have 5 byte address
 * 					other pipes have 1 byte address(LSB). Other bytes are taken from
 * 					the P1 pipe address.
 * 
 */
 
void 
NRF24L01_SetRxAddress(	unsigned char ucDataPipe,
						unsigned char *pucAddress)
{
	if(pucAddress)
	{
		switch(ucDataPipe)
		{
			case 0:
			case 1:
				NRF24L01_RegisterWrite_Multi((RF24_RX_ADDR_P0 + ucDataPipe), pucAddress, 5);
				break;
			case 2:
			case 3:
			case 4:
			case 5:
				NRF24L01_RegisterWrite_8((RF24_RX_ADDR_P0 + ucDataPipe),pucAddress[0]);
				break;
			default:
				break;
		}
	}
}


/* PS:
 * 
 * Function		: 	NRF24L01_SetRXPacketSize
 *
 * Arguments	: 	ucDataPipe		:	Data pipe number
 * 					ucPacketSize	:	Packet size. (Maximum is 32)
 *
 * Return		: 	None
 *
 * Description	: 	Set the packet size for a RX pipe.
 *
 */

void
NRF24L01_SetRXPacketSize(	unsigned char ucDataPipe,
							unsigned char ucPacketSize)
{
	if(ucPacketSize < 32)
	{
		NRF24L01_RegisterWrite_8((RF24_RX_PW_P0 + ucDataPipe), ucPacketSize);
	}

