pradeepa-s/pdlib_nrf24l01/arm/stellaris_lm4f120h5qr/pdlib_nrf24l01.c
		if(NULL != pucBuffer)
		{
			memcpy(pucBuffer, pucData, uiLength);

			_NRF24L01_CSNLow();

			g_ucStatus = pdlibSPI_TransferByte(RF24_W_REGISTER | ucRegister);
			pdlibSPI_SendData(pucBuffer, uiLength);
			
			_NRF24L01_CSNHigh();

			free(pucBuffer);
		}
	}
}


/* PS:
 * 
 * Function		: 	NRF24L01_RegisterRead_8
 * 
 * Arguments	: 	ucRegister	:	Address of the register
 * 
 * Return		: 	The value in the 8 bit register
 * 
 * Description	: 	This function will write 1 byte of data to an 8 bit
 * 					register. The function will update the Status
 * 					variable too.
 * 
 */
 
unsigned char
NRF24L01_RegisterRead_8(unsigned char ucRegister)
{
	unsigned char ucData;

	_NRF24L01_CSNLow();

	g_ucStatus = pdlibSPI_TransferByte(RF24_R_REGISTER | ucRegister);
	
	ucData = pdlibSPI_TransferByte(RF24_NOP);

	_NRF24L01_CSNHigh();

	return ucData;
}


/* PS:
 *
 * Function		: 	NRF24L01_RegisterRead_Multi
 *
 * Arguments	: 	ucRegister	:	Address of the register
 * 					pucBuffer	: 	Buffer to store the reply
 * 					uiLength	:	Length of the buffer
 *
 * Return		: 	Status register value will be returned.
 *
 * Description	: 	This function will read more than 1 byte of data from a
 * 					register. The function will update the Status
 * 					variable too.
 *
 */

unsigned char
NRF24L01_RegisterRead_Multi(	unsigned char ucRegister,
								unsigned char *pucBuffer,
								unsigned int uiLength)
{
	int i;

	_NRF24L01_CSNLow();

	g_ucStatus = pdlibSPI_TransferByte(RF24_R_REGISTER | ucRegister);

	for(i = 0; i<uiLength; i++)
	{
		pucBuffer[i] = pdlibSPI_TransferByte(RF24_NOP);
	}

	_NRF24L01_CSNHigh();

	return g_ucStatus;
}


/* PS:
 *
 * Function		: 	NRF24L01_SendCommand
 *
 * Arguments	: 	ucCommand	:	Command to send.
 * 					pucData		:	Data associated with the command
 * 					uiLength	:	Length of the data field
 *
 * Return		: 	None
 *
 * Description	: 	This function will send any command with the data buffer
 * 					to the RF module. This will also update the status register.
 * 					If there is no payload for the command set the pucData NULL and
 * 					make the uiLength as 0
 *
 */

void
NRF24L01_SendCommand(	unsigned char ucCommand,
						char *pcData,
						unsigned int uiLength)
{
	unsigned char *pucBuffer = (unsigned char*) malloc(sizeof(unsigned char) * (uiLength + 1));

	if(NULL != pucBuffer)
	{
		pucBuffer[0] = ucCommand;

		if(NULL != pcData)
		{
			memcpy(&pucBuffer[1], pcData, uiLength);
		}

		_NRF24L01_CSNLow();

		pdlibSPI_SendData(pucBuffer, uiLength+1);

		_NRF24L01_CSNHigh();

		free(pucBuffer);
	}
}


/* PS:
 *
 * Function		: 	NRF24L01_SendRcvCommand
 *
 * Arguments	: 	ucCommand	:	Command to send.
 * 					pucData		:	Buffer to get data
 * 					uiLength	:	Length of the buffer
 *
 * Return		: 	None
 *
 * Description	: 	This function will send any command with the data buffer
 * 					to the RF module. After that it will read the specifed
 * 					amount of data and store it as the reply in the provided
 * 					buffer.
 *
 */

void NRF24L01_SendRcvCommand(unsigned char ucCommand, char *pcData, unsigned int uiLength)
{
	if(pcData){
		int i = 0;

		_NRF24L01_CSNLow();

		g_ucStatus = pdlibSPI_TransferByte(ucCommand);

		for(i = 0; i < uiLength; i++)
		{
			pcData[i] = pdlibSPI_TransferByte(RF24_NOP);
		}

		_NRF24L01_CSNHigh();
	}
}


// ----------------  Hardware Pin Control ------------------ //


/* PS:
 *
 * Function		: 	_NRF24L01_CELow
 *
 * Arguments	: 	None
 *
 * Return		: 	None
 *
 * Description	: 	This function drives the CE pin low
 *
 */

static void
_NRF24L01_CELow()
{
	ROM_GPIOPinWrite(g_ulCEBase, g_ulCEPin, 0x00);
}


/* PS:
 *
 * Function		: 	_NRF24L01_CEHigh
 *
 * Arguments	: 	None
 *
 * Return		: 	None
 *
 * Description	: 	This function drives the CE pin high
 *
 */

static void
_NRF24L01_CEHigh()
{
	ROM_GPIOPinWrite(g_ulCEBase, g_ulCEPin, 0xFF);
}


/* PS:
 *
 * Function		: 	_NRF24L01_CSNLow
 *
 * Arguments	: 	None
 *
 * Return		: 	None
 *
 * Description	: 	This function drives the CSN pin low
 *
 */

static void
_NRF24L01_CSNLow()
{
	ROM_GPIOPinWrite(g_ulCSNBase, g_ulCSNPin, 0x00);
}


/* PS:
 *
 * Function		: 	_NRF24L01_CSNHigh
 *
 * Arguments	: 	None
 *
 * Return		: 	None
 *
 * Description	: 	This function drives the CSN pin high
 *
 */

static void
_NRF24L01_CSNHigh()
{
	ROM_GPIOPinWrite(g_ulCSNBase, g_ulCSNPin, 0xFF);
}


